# put your python code here
a = int(input())                     # Ввод данных и присвоение переменной a:   
b = int(input())                     # Ввод данных и присвоение переменной b:
print(a + b)                         # Cумма чисел a и b:
print(a - b)                         # Разность чисел a и b:
print(a * b)                         # Произведение чисел a и b:
print(a / b)                         # Частное чисел a и b:
print(a // b)                        # Целую часть от деления числа a на b:
print(a % b)                         # Остаток от деления числа a на b:
print((a ** 10 + b ** 10) ** (0.5))  # Корень квадратный из суммы их 10-х степеней:
